<script>
    import {createEventDispatcher} from 'svelte';
    const dispatch = createEventDispatcher();
    import { Logo, Btn } from '$lib'

    let lang = 'en'
    let terms = false
    let privacy = false

    const submit = async () => {
        if(terms && privacy) {
            dispatch('change', 'yes')
        }
    }
</script>

<Logo />

<div class="container mx-auto max-w-[94%] md:max-w-3xl pb-40 rtl">
    <div class="text-center text-primary font-bold text-2xl my-4 leading-none">
        الشروط والأحكام
    </div>

    
    <div class="overflow-y-scroll text-black mb-4" style="height: calc(100vh * 0.35);">
        <ol>
            <li>يسري العرض الترويجي من 20 يونيو الى 13 يوليو 2022 في الإمارات العربية المتحدة ("العرض").</li>
            <li>اشترِ أيًا من حزم ليز الترويجية (الثنائية أو الثلاثية) واحصل على فرصة الفوز بجوائز فورية.</li>
            <li>يجب على المتسوق عند الدفع مسح رمز الاستجابة السريعة وسيتم توجيهه إلى الموقع المصغر للعرض.</li>
            <li>في حال فاز المتسوق، فسيتم إرسال بريد إلكتروني إلى عنوان البريد الإلكتروني المقدم من قبل المتسوق مع تفاصيل الجائزة.</li>
            <li>ستكون صلاحية الجائزة حسب الشروط والأحكام المحددة في البريد الإلكتروني.</li>
            <li>العرض الترويجي متاح لجميع المقيمين وغير المقيمين في دولة الإمارات العربية المتحدة، الذين تتراوح أعمارهم من 16 سنة فما فوق، باستثناء المروجين للعرض داخل المتجر وجميع الشركات التابعة لشركة بيبسيكو أو الشريكة لها، أو الشركة السعودية للمأكولات الخفيفة المحدودة، أو بيبسيكو للتعبئة وأي أفراد / مجموعات أخرى تشارك في هذا العرض الترويجي.</li>
            <li>لا تخضع الجوائز للاسترداد أو التجزئة أو التحويل أو الاستبدال بأي عنصر آخر أو الاستبدال النقدي.</li>
            <li>يتم تقديم الجوائز "كما هي" و "حسب توفرها" بدون أي ضمان من أي نوع سواء صريحًا أم ضمنيًا، بما في ذلك على سبيل المثال لا الحصر الضمانات الضمنية الخاصة بالتسويق أو الملاءمة لغرض معين أو عدم الانتهاك.</li>
            <li>الجوائز هي التالية:<br /> أ. أنغامي &ndash; 425 رمز &ndash; اشتراك لمدة شهر<br /> ب. Vox &ndash; 200 تذكرة <br /> ج. دبي أوبرا &ndash; 50 قسيمة شرائية <br /> د. سنسيشيا سبا &ndash; 50 قسيمة شرائية</li>
            <li>قرارات المنظمين فيما يتعلق بأي جانب من جوانب العرض الترويجي نهائية وملزمة لكل شخص يدخل و / أو يشارك في الحملة.</li>
            <li>يحتفظ المنظم بشكل رئيسي الشركة السعودية للمأكولات الخفيفة المحدودة ("المنظم") بالحق في إلغاء هذا العرض الترويجي أو إجراء تغييرات على الشروط والأحكام من وقت لآخر وفقًا لتقديرها الخاص ودون إشعار، وتقع على عاتق المتسوقين المشاركين مسؤولية مراجعة الشروط لأية تغييرات.</li>
            <li>يعتبر استمرار المشاركة في العرض الترويجي بعد أي تعديل على الشروط والأحكام بمثابة قبول لهذه التغييرات.</li>
            <li>يفهم المشاركون أن الدخول في الحملة لا ينشئ علاقة ارتباط بين المشاركين والمنظم.</li>
            <li>المنظم والشركات والكيانات المرتبطة بها هم على التوالي المالكين الحصريين لجميع النسخ والنصوص والبرمجيات والرسومات والشعارات والصور والتصميمات وجميع حقوق النشر والعلامات التجارية وغيرها من حقوق الملكية الفكرية أو حقوق الملكية وجميع الحقوق المرتبطة بالعرض الترويجي.</li>
            <li>تشكل الشروط، جنبًا إلى جنب مع أي إشعارات أخرى ينشرها المنظم على الموقع الإلكتروني و / أو المواد الإعلانية المتعلقة بالعرض الترويجي، الشروط الكاملة التي تحكم العلاقة بين المشاركين والمنظمين فيما يتعلق بالمشاركة في العرض الترويجي.</li>
            <li>يخضع هذا العرض الترويجي لقوانين دولة الإمارات العربية المتحدة.</li>
            <li>من خلال المشاركة في هذا العرض الترويجي، فإنك تقر بأنك راجعت ووافقت على البنود والشروط المذكورة أعلاه.</li>
            <li>يوافق المشاركون ويصرّحون بأن الشركة غير مسؤولة ولا يمكن تحميلها أية مسؤولية عن أي أضرار مباشرة، أو غير مباشرة، بسبب حادث، يمكن أن تترتب عنها عقوبات ناجمة عن استعمال الفائز للجائزة.</li>
            <li>قد يطلب من الفائزين المشاركة في بعض الإشهار والموافقة على الاستخدام الكامل لأسمائهم وصورهم وبياناتهم الشخصية وما يشبه في هذا الإشهار.</li>
        </ol>
    
    </div>

    <div class="grid grid-cols-1 md:grid-cols-2 md:gap-4">

        <label class="flex items-center my-3 w-full">
            <input type="checkbox" class="checkbox checkbox-accent checkbox-md rounded mr-2" bind:checked={terms} /> 
            <span class="leading-none mr-1 text-black">
                أوافق على الشروط والأحكام
            </span>
        </label>

        <label class="flex items-center my-3 w-full">
            <input type="checkbox" class="checkbox checkbox-accent checkbox-md rounded mr-2" bind:checked={privacy} /> 
            <span class="leading-none mr-1 text-black">
                لقد قرأت وأوافق على  <a href="/privacy" target="_blank" class=" text-primary font-bold underline">سياسة الخصوصية</a>
            </span>
        </label>
    </div>

    <div class="mx-8 my-6">
        <Btn 
            onPress={submit}
            text={'أوافق'}
            disabled={!terms || !privacy}
        />
    </div>

</div>

<style>
    ol {
        padding: 0 32px 10px;
        list-style: decimal;
        line-height: 1.1;
        font-size: 14px;
    }
    ol li {
        margin-bottom: 8px;
    }
</style>
